{
    "csse": [
        {
            "time": "12:45 PM - 1:00 PM",
            "projectId": "csse-6-1245",
            "title": "Graphitti: Automation and Documentation",
            "studentName": "Conor McIntosh",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Michael Stiber",
            "posterLink": "./posters/csse/Conor McIntosh.png",
            "abstract": "During my Capstone project, I worked with Professor Stiber in his Intelligent Networks Lab on the Graphitti system. Graphitti is a high-performance simulator of network structured systems meant for use by researchers that need a high-performance simulator for large-scale, long-duration simulations.\n\nMy tasks in this project consisted of five main topics, mostly consisting of creating automated workflows using GitHub’s Action system, and lots of documentation. The first task was to provide an automated workflow to convert .puml files into .svg and .png files during either a push or pull request to the repositories master branch. There was a necessity for a simpler way of creating UML documentation files. This workflow made it easy to convert between .puml files to .png/.svg files.\n\nThe second was to reorganize and restructure the previous documentation for the Graphitti system due to its poor structure and being unintuitive to follow/read through. This required the creation of two new header categories called User and Developer documentation meant for users and developers respectively. This allowed for a more object-oriented structure to all of the documentation.\n\nThe third task was to create a manually activated workflow that would publish the Graphitti documentation to our GitHub Pages documentation website. There was a necessity to manually publish documentation changes due to new changes only being published at the beginning of the month. This new workflow allowed for quick deployment of new and pertinent documentation.\n\nThe fourth task was to reformat the code base in order to consistently follow our format guidelines. The code style guidelines were severely underfollowed during most of the development of the Graphitti system. I used a .clang-format file due to its wide selection of customizable style checks and applied it across all 135 .cpp/.h files.\n\nLastly, I created an automated workflow to check for format/style violations on any new .cpp/.h program files during a push or pull request to the master branch of the repository. This new workflow automates the process of checking for style violations for quick checking that developers can easily understand.\n\nDue to my efforts on the Graphitti repository, developers will spend less time on tedious, time-consuming tasks and more time on actually developing the Graphitti system while also maintaining quality documentation of it."
        },
        {
            "time": "1:00 PM - 1:15 PM",
            "projectId": "csse-6-100",
            "title": "JarBeGone: A Text Summarizer for Academic Papers",
            "studentName": "Kayla Perez",
            "studentMajor": "CSSE",
            "projectType": "Individual Project",
            "facultyAdvisor": "Dr. Annuska Zolyomi",
            "posterLink": "./posters/csse/Kayla Perez.jpg",
            "abstract": "Academic papers published in scholarly journals are notoriously difficult to read and understand. A majority of these papers require extensive background knowledge of the subject to comprehend the material. Although these papers tend to be written for an audience composed of researchers or academic professionals, many higher education students are tasked with reading these papers to further their education. Academic papers can be difficult to read though for someone not familiar with the jargon, acronyms, or technical concepts presented.\n\nEnter JarBeGone, a tool I created to help higher education students comprehend academic papers. JarBeGone is a text summarizer built specifically for academic papers. It uses Natural Language Processing techniques to generate a summary for each paper. These summaries are extractive, meaning that they only contain text from the original paper. No new text is generated.\n\nJarBeGone began as a simple idea between myself and three friends for our Management Principles class. We were tasked with coming up with an innovative solution for a common problem. I took the ideas we outlined in that assignment a step further to create a summary generator for academic papers. I started by sending out a survey to higher education students (current and recent) to gather ideas for requirements and learn about the struggles students have reading and comprehending academic papers. With those results in hand, I got to work on making JarBeGone a reality. \n\nThe result of this project is a working prototype of the JarBeGone text summarizer with a web front-end. I built the front-end using Flask, a web development framework for Python. Users can upload their PDF and choose the length of their summary, which is based on the length of the original paper (e.g. a short summary is 10% of the size of the original paper). The summary is generated in real-time and is displayed next to the original paper so users can refer back to it for context. Currently, the prototype only works with 8 different papers I selected, but future work would allow the tool to work with any paper.\n\nText summarizers exist for other applications, like summarizing one-page news articles, but nothing like this exists for the complex jargon and formats of academic papers. With future work involving other Natural Language Processing techniques, extensive usability studies, and adding more interactivity, JarBeGone will help higher education students of all kinds better understand academic papers."
        },
        {
            "time": "1:15 PM - 1:30 PM",
            "projectId": "csse-6-115",
            "title": "User-Centered Design of Technology for Student Teams in Higher Education",
            "studentName": "Christopher Powell",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Annuska Zolyomi",
            "posterLink": "./posters/csse/Chris Powell.jpg",
            "abstract": "I helped build the foundation of a Student Team Formation application, a web application based on the User-Centered Design of Technology for Student Teams in Higher Education research that Professor Zolyomi conducts. The purpose of this project was to design an application that university instructors can use to facilitate forming teams in their classes. The initial step involved identifying user requirements by gathering feedback through surveys of both instructors and students. We then performed a data analysis of the survey results to identify the requirements. \n\nOnce we identified requirements, the technology used was chose through collaboration with other students involved in the research. We decided on using React for the front-end as it was a well-known front-end framework, with helpful documentation. For the back-end, we chose Node.js due to the compatibility with React and a MySQL database. My role was to create the front-end and choose the frameworks and architecture design that would allow connections from the front-end to the back-end. Once connected, I was able to build REST APIs that sent HTTP requests to the back-end and displayed the response on the front-end.\n\n The result was a full-stack web application that authenticates users to a database and provides the tools needed to implement the team forming algorithm in the future. The significance of this application stems from providing a tool for instructors that helps improve the overall performance of teams in the classroom. This application and research can help identify those factors that contribute to positive team experiences, while also promoting an improved learning experience for teamwork. As Professor Zolyomi continues her research, future students can improve on this application with more research and added functionality."
        },
        {
            "time": "1:30 PM - 1:45 PM",
            "projectId": "csse-6-130",
            "title": "User-Centered Design of Technology for Student Teams in Higher Education",
            "studentName": "Tommy Ni",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Annuska Zolyomi",
            "posterLink": "./posters/csse/Tommy Ni.jpg",
            "abstract": "Teamwork in higher education has many benefits for the students involved. They learn many skills that they wouldn’t otherwise get without collaborating with other students. Although most teamwork experiences that students face can be positive ones, many also face negative experiences. Those negative experiences can not only hinder the development of such skills that were meant to be developed, but students would also dread any future teamwork in their time in higher education. This was the problem to be solved by our research group.\n\nContinuing previous students’ work on this “User-Centered Design of Technology for Student Teams in Higher Education” project led by Professor Annuska Zolyomi, I and two other students created a proof-of-concept prototype of a web application. This web application is designed to help students and instructors form highly productive teams that mesh well together based on different criteria. These criteria are based on the survey we sent out at the beginning of the quarter that gathers data on both students’ and instructors’ experiences of positive and negative teamwork that they have had in the classroom. Once we analyzed the survey data, we partitioned the project work into roles for the database, front-end, and user experience. I was in charge of the design and implementation of the database. The result of my portion of the project is a MySQL database, an open-source relational database management system, that holds key information for the proof-of-concept prototype. Such key information includes student and instructor account information, students’ present and past teammates, students’ skills, and their availability schedule. \n\nAlthough there are many general team maker web applications, most of them only provide randomly generated teams and are not tailored for classroom-based learning. Currently our prototype supports features such as signing up/logging in for the web application, viewing your own profile, and viewing teams for one class. Some future work involves a working algorithm that optimizes team-formation based on different criteria, adding and removing skills from a user’s profile, and integration with the Canvas Learning Management System. Our research and work on our web application will help students experience better collaboration during their higher education."
        },
        {
            "time": "1:45 PM - 2:00 PM",
            "projectId": "csse-6-145",
            "title": "'Escape of Happiness' - Map Generation",
            "studentName": "Adhiesha Jayasinghe",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Yusuf Pisan",
            "posterLink": "./posters/csse/Adhiesha Jayasinghe.png",
            "abstract": "The Interactive Design for Education, Entertainment, and Art (IDEEA) group was developed to transform education and foster community & industry engagement by bringing together innovative design, development, teaching, and application of interactive media technologies. After developing a smaller project as a team-building exercise, our group set to work building a larger, more ambitious project to demonstrate our combined effectiveness. \n\nBuilding on a design idea created by one of our design students, we constructed a mechanical backlog that listed every feature we wanted to include in the project and specified how the features were intended to work. From this, we produced a series of project milestones to help guide our development process & establish deadlines. We assigned tasks on a week-by-week basis to push us closer to our completed project and performed weekly check-ins with our advisors to ensure we were on track. We put our work in front of testers to elicit feedback and iteratively build improvements into the project. \n\nThe result is a science-fiction horror game called “Escape of Happiness.” The game largely met the initial expectations laid forth during our design process, containing four randomly generated levels populated with enemies the player can encounter and fight, along with various “gimmicks” that make navigating each level progressively more challenging, including requiring players to find and activate power generators, limiting players’ oxygen supply, and scaling up the difficulty of enemies in each level. \n\nThough the project meets its technical & artistic goals, the challenge of making it fun for its target audience calls for additional balancing and iterative testing of enemy encounters, with a focus on making the overall experience difficult but not insurmountable or repetitive. However, the project did successfully demonstrate both the skills of its composite members as well as the value in combining those skills to build an ambitious project. Hopefully our work serves as both a useful experience for each of us going forward as well as a guidepost for future IDEEA students to continue developing successful projects."
        },
        {
            "time": "2:00 PM - 2:15 PM",
            "projectId": "csse-6-200",
            "title": "Building a Terraform Provider to Manage a Data Routing Layer",
            "studentName": "Alex Lai",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Yusuf Pisan",
            "posterLink": "./posters/csse/Alex Lai.jpg",
            "abstract": "For my capstone project in Winter/Spring 2022, I worked as a Software Engineer Intern at Datadog. Datadog is a company based in New York that makes applications for modern monitoring and security. Datadog, their application, is a monitoring and analytics tool for information technology, that can be used to determine performance metrics as well as event monitoring for infrastructure and cloud services.\n\nMy goal for my capstone is to get a better feel of how to approach the daily work in software engineering, as well as work on a project that has a high impact on real-world applications.\n\nI was a backend engineer on Datadog’s metric time-series team, which is responsible for managing Datadog’s core data systems for metrics and alerts. I developed code for the data sharding layer of Datadog, I worked with many different tools and technologies such as Terraform, an Infrastructure as code program, Golang, a programming language made by Google, and Kubernetes, an open-source container orchestration system for automating software engineering deployment, and much more.\n\nDuring my internship, I made several key pull requests, the most notable one being removing the spammy logging metric in the error logging aspect of Datadog’s program. My intern project used Terraform to manage Datadog’s data sharding layer to perform CRUD (Create, Read, Update, and Delete) operations, this project took the longest, but I finished it a week before the end of the internship. AS a result, I was able to improve the speed of modifying data points in the sharding system to now be twice as fast, and each piece of data in the data sharding layer can be viewed and modified from one file. This was significant to the team because it sped up the process of CRUD on the data sharding layer, which saves a lot of time.\n\nMy internship at Datadog helped me improve as a software engineer and introduced me to a rapidly growing company and what it is like to work there. At the end of my capstone, I did not receive an offer to continue working, but many of the people there are willing to open the door to come back if I am interested in working in New York City. The key takeaway is that learning fast is the most important skill in the software engineering industry."
        },
        {
            "time": "2:15 PM - 2:30 PM",
            "projectId": "csse-6-215",
            "title": "IDEEA: Interactive Design for Education Entertainment and Art",
            "studentName": "Antoinette Calkins",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Yusuf Pisan",
            "posterLink": "./posters/csse/Antoinette Calkins.png",
            "abstract": "Ideea - interactive design for education entertainment and art\n\nThe purpose of ideea was to create an interdisciplinary team of programmers and UX/UI designers to create a deliverable to be published on a major platform, like Steam or itch.io. A team of 5 people was formed, consisting of 3 programmers and 2 designers. Over the course of 3 quarters, 2 projects were completed. The first project was a recreation of an existing game to build team synergy and figure out the roles of each member. This first project was done over the course of one quarter (12 weeks), before the team moved on to the larger, final project.\n\nThis final project consisted of a game proposed by one of the designers, which is a 2D sci-fi horror roguelite, with a turn-based combat system inspired by Final Fantasy VII and Paper Mario. The game was developed using the Unity engine, over two quarters. By this time, our team had established a schedule for meetings and weekly deadlines to complete features, so we were able to start right away and get a lot done by the time we reached our deadline. \n\nThe result was satisfactory for the team, despite having to make some changes here and there to accommodate our time constraints. We created a document listing all the mechanics and features that are required, as well as some nice-to-have features. This document was our guideline when deciding on what to work on each week, and what features should be prioritized.\n\nThe significance of this project and our team’s successful collaboration is that this is the first project created under the ideea group. This not only gave us some practical experience developing a project, but it also helped our advisors improve the project for future students."
        },
        {
            "time": "2:30 PM - 2:45 PM",
            "projectId": "csse-6-230",
            "title": "IDEEA - A Game Development Project",
            "studentName": "Jacob Chesnut",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Yusuf Pisan",
            "posterLink": "./posters/csse/Jacob Chestnut.jpg",
            "abstract": "The IDEEA game development project was a yearlong project throughout three academic quarters which involved three main objectives: learning and gaining experience with an interdisciplinary team, creating a game recreation, and delivering a final polished game. The interdisciplinary team I worked with was comprised of three CSSE students and two IMD students, the other students on the IDEEA team are Adhiesha Jayasinghe, Antoinette Calkins, Bryan Yee, and Spencer Jong.\n\nWith the first point of working with an interdisciplinary team, there were a lot of lessons learned during the process of creating both the game recreation and the polished game. Early on, our strategy was to have two sets of meetings roughly weekly for each group within the team. There was a meeting between CSSE students on what to do for the project, and a seperate meeting between IMD students on what to do. We quickly realized that the separate meetings were causing issues of miscommunication between the two groups, and after some revisions, the final process we followed was an AGILE system similar to a SCRUM cycle. Our entire team would meet weekly and go over what was done as well as what everyone would do over the next week. Between this and continuous weekly meetings with the capstone advisors progress went much more smoothly.\n\nDuring the first quarter of the project, we worked on recreating the platformer Nv2.0, and the point of this game recreation was for teambuilding and for understanding the game development process. In the end we were able to complete the game recreation successfully and figure out a functional team schedule.\n\nFrom the second quarter onwards our group worked on a new game. The game idea was brought about by Bryan Yee, and the game we created is a roguelite called “Escape of Happiness”. The core gameplay follows the player character through a randomly generated space station as they collect permanent upgrades to fight through enemies onboard a space station. The development process for this was relatively straightforward, as we went from an initial design, to creating features for the game, and having the game go through multiple playtesting stages and iterations before reaching a final, polished game."
        }                   
    ]
}