{
    "csse": [
        {
            "time": "12:45 PM - 1:00 PM",
            "projectId": "csse-4-1245",
            "title": "Cloud Security via PacBot Platform, TechX Internship, T-Mobile ",
            "studentName": "Andrew Huelsdonk",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship",
            "facultyAdvisor": "Dr. Min Chen",
            "posterLink": "./posters/csse/Andrew Huelsdonk.png",
            "abstract": "This capstone was part of an ongoing T-Mobile internship (started Oct. 10, 2021) within the D3 operations unit of the Enterprise Technology Solutions (ETS) team. D3 maintains approximately 350 servers used to capture consumer and retail store analytics data. Data security is one of its primary functions.\n\n A major contributor to data-breach vulnerability in any organization is backlogged security patching. Too often, security can be back-burned when other priorities arise or when patching activities risk disrupting server availability. To address this business need, my capstone project focused on streamlining cloud security and developing timely, consistent solutions – using automated processes as much as possible – to minimize the potential for deferred maintenance. This work will function as a “best-practices bridge” until we move our servers to a Kubernetes environment later this year. It will sunset at that time.\n\nMy work followed three objectives/focus areas:\n\n 1) Using the PacBot Platform, an open-source tool developed by T-Mobile, for security monitoring, reporting and remediation of security violations in AWS and Azure environments.\n\n2) Creating scripting for use through a GitLab pipeline to patch EC2 instances using shell commands and Python to update kernels.\n\n3) Fixing unique PacBot violations (examples, tenable scan violations and Log4j).\n\nSignificant deliverables included:\n\nClearing most severe PacBot-detected issues to ensure a secure environment.\n\n Rotating SSH keys in our servers and standardizing key practices across work teams. \n\n Creating an IMDSv2 implementation and communication plan, which included developing testing validation routes, creating a staff standby system to address outages, instituting moratorium times when sensitive upgrading can’t be completed during low-staff times, procedure notifications to alert team members when patching will occur, and verification to ensure a fix has succeeded. \n\n Updating servers to IMDSv2, a tool that allows other services to look at servers’ metadata securely through session-based token storage. \n\n Providing a bridge ensuring best-practices security updating, pending our move to Kubernetes later this year. Long-term, the shift to Kubernetes will eliminate many of the labor-intensive manual security fixes currently required for legacy servers. \n\nMy work will continue with T-Mobile as a full-time associate software engineer, beginning June 13, 2022."
        },
        {
            "time": "1:00 PM - 1:15 PM",
            "projectId": "csse-4-100",
            "title": "Understanding Measurement: Target Technical Services (TTS) Intern",
            "studentName": "Aria Li",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship",
            "facultyAdvisor": "Dr. Min Chen",
            "posterLink": "./posters/csse/Aria Li.png",
            "abstract": "I recently was a software engineering intern at Target. This internship lasted 10 weeks and was under the Target Technical Services program (TTS). 3 other interns and I were placed on the Measurement team which was an Agile development team that collected, stored, and used data and focused on the 5 core concepts: collect, store, visualize, analyze, and notify. My team’s primary customer was Target’s internal application teams. Using the data and metrics given to us by our customers through metrics and log aggregation pipelines, we could provide metrics, logs, checks, and alerting to enable that all of Target’s software continues to run smoothly and efficiently. Throughout my internship, my focus was increasing the efficiency of customer’s sending their logs through our pipeline to be collected and analyzed. This means that I spent a lot of time collecting metrics on our pipeline and analyzing the metrics through data visualization tools like Grafana. Then, I could use that analysis to identify areas in our software that could be more efficient and modified the software to increase the overall proficiency of our data collection processes. As a result, my team and I were able to increase the efficiency of our pipelines, provide 24/7 support to Target’s internal teams and their applications, and handle up 100’s of billions of data points each day. Without the help of my team and work, Target would be unable to handle and maintain their internal products, such as the POS systems at Target stores. "
        },
        {
            "time": "1:15 PM - 1:30 PM",
            "projectId": "csse-4-115",
            "title": "Full-Stack Mobile Game Development for A Luckier Smith",
            "studentName": "Isabella Griego",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship",
            "facultyAdvisor": "Dr. Min Chen",
            "posterLink": "./posters/csse/Isabella Griego.png",
            "abstract": "The Bellevue-based start-up gaming company A Luckier Smith has been working on their first mobile video game titled “Bang! Bang!”, this game has been in development for 2 years and is set to launch in Q3 of 2022. Upon joining the team, I became acquainted with senior developers and other junior developers to clean up and polish the functionality for all the existing structure that the game had been built upon so far to prepare the game for launch.\n\nAfter joining the programming team, I was guided by the senior developers to familiarize myself with many new tools and languages such as: our backend service Firebase, Angular for our web-dashboard, and gaining more proficiency in Unity which is our game engine. From there, I was given a variety of tasks to complete at many levels of the game’s development including the backend, frontend, and I contributed design documents to help outline the game’s functionality. As a team, we check in at least once a week in sprint meetings to go over the work that has been done, assign more tasks, and manage any blockers we have for development.\n\nCurrently, I am still working with the “Bang! Bang!” team and plan to work with them until the launch of the game. The game had very limited functionality when I had first joined the team for this project, but now we have many working builds that we are testing in game’s final stages to polish it for launch. Not only that, but we have a more concrete timeline for workstreams to lead up until the launch of the game and hopefully soon we will have a set release date with trailers for the game.\n\nThrough the process of this project and working on this team, I have learned what working as a developer with a small team in a startup company looks like and have been encouraged to expand my own technical and personal skills to contribute to the working environment. I am looking forward to finishing this game with A Luckier Smith, and possibly continuing work with them on future mobile games."
        },
        {
            "time": "1:30 PM - 1:45 PM",
            "projectId": "csse-4-130",
            "title": "EYE Research Group: UI/UX Designer",
            "studentName": "Zihao Dou",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Bill Erdly",
            "posterLink": "./posters/csse/Zihao Dou.png",
            "abstract": "We are the Research Group of Educating Young Eyes Project. We specialize in the assessment  and  treatment  of  myopia  in  children  using  the  latest  modern  technology. And raise awareness of the importance of vision problems in children. \n\nOn this project, I joined the UI/UX team. My job is to analyze the original website and find bugs. And design for our new project Quick Check Application.\n\nThe  design  of  the  web  page  and  the  design  of  the  Application  were  designed  in cooperation  with  the  team  through  Figma.  The  main  task  now  is  the  design  and development of Quick Check Application.\n\nMy  contribution  to  this  project  is  to  design  a  Landing  page  for  Quick  Check Application for promotion. In addition, we used Unity to build the script for the CISS (Convergence  Insufficiency  Symptom  Survey)  version  of  QC  project.  However,  the project has not been completed and is still in progress.\n\nI  did  some  analysis  for  some  of  the  original  sites.  Analyzed  the  function  and audience of each website, found the advantages and disadvantages. In addition, the bugs of some websites are sorted out.\n\nI did some analysis for some of the original sites. Analyze the functions and users of  each  website  and  find  the  advantages  and  disadvantages.  In  addition,  the  bugs  of some  websites  are  sorted  out.  These  will  bring  a  lot  of  convenience  for  websites improvement.\n\nIn the whole Capstone project, I realized the importance of the team in the whole project development. When I have difficulties, my team members often give me a lot of  advice  and  help.  I  have  accumulated  a  lot  of  work  experience  in  website  and Application design."
        },
        {
            "time": "1:45 PM - 2:00 PM",
            "projectId": "csse-4-145",
            "title": "EYE Center Website & CI Analytics",
            "studentName": "Aysha Altayar",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Bill Erdly",
            "posterLink": "./posters/csse/Aysha Altayar.png",
            "abstract": "During the span of my research with the EYE research group, my role as a UI/UX designer was to do an intense redesign of the EYE research group website as there was a lack of brand visibility, poor design implementation, and an unclear objective. Through the use of Figma and the MVC framework, a solid and refined structure was guaranteed for the website with a specific focus on the research done by the group. Other than my role as a UI/UX designer for the EYE research group, I was also a quality assurance engineer at IOINTEL for the last portion of my capstone where my work revolved around offering innovative solutions to keep up with ongoing customer requirements. Writing test scripts, debugging, and documenting every step of the way were a few of the many responsibilities I was tasked with doing. Behind all of this, the main purpose was to make sure that the application worked according to the requirements listed before launching. \n\nAs a result, an easily navigable website, clear user guidance, increased brand visibility, and unique typography became part of the final product for the redesign of the EYE research group website. Through the promotion of simplicity by effective white space handling and a focus on minimalism, user satisfaction and website familiarity increased. As for my position as a quality assurance engineer, I produced advanced solutions to decrease the test preparation time by half through the creation of an automated python script to generate test files. Thus, leaving enough time for an intense review of work before the final launch. \n\nThe significance of my work as a UI/UX designer gave way to covering various user perspectives, fulfilling user needs and relaying clear information to users while increasing EYE research group recognition. On the other hand, my work as a quality assurance engineer played a great significance in the product creation process as many defects were prevented in production. This saved time so that more efficient and innovative solutions were explored and presented to the customer. The timely and relevant implementation of the design requirements proved to produce greater solutions and a faster workflow. \n\nIn conclusion, my role in both the EYE research group and IOINTEL allowed me to learn endlessly from different perspectives while solving various problems. Knowledge in technical languages, design frameworks, and strong communication allowed for a successful completion of innovative products. "
        },
        {
            "time": "2:00 PM - 2:15 PM",
            "projectId": "csse-4-200",
            "title": "Software Development for QuickCheck Data Portal and Server",
            "studentName": "Bryan Tjendra",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Bill Erdly",
            "posterLink": "./posters/csse/Bryan Tjendra.png",
            "abstract": "Vision is an extremely important factor for children in their development, a lack of access to vision services will limit a child’s potential and growth. EYE Research Group is an organization that helps provide children access to vision tests and treatments. The organization is developing its QuickCheck Application that aims to provide an automated, free, and accurate preliminary vision screening remotely. By automating these tests remotely, the app can reduce workload for nurses and optometrists and reach a larger population. My role in this project is to develop the QuickCheck Data Portal Web Application and Server. \n\nFor the application to be able to be available to vision specialists, it must be HIPAA compliant. The first step to be HIPAA compliant is that the application must only authorize access of sensitive information to relevant parties while maintaining confidentiality and integrity data. The security of the overall system is improved by creating an Authorization Server and establishing secure connections. The Authorization Server was designed and implemented with refreshable endpoints using JSON Web Tokens and secure connections was set up via HTTPS Protocol. This allows for a streamlined and automated authorization of users and a secure data transfer through encryption. The resource server was further developed by adding endpoints to handle user, runtime, and resource errors and fixing legacy software bugs. These additions will ensure that any potential errors in the application are handled properly.\n\nFor testing purposes and future developments, an error logging endpoint was created for developers working on the mobile application and unit tests were created for all the server’s API endpoints. To help future developments of QuickCheck, the architecture and current progress of QuickCheck are extensively documented to bring future developers up to speed quickly.\n\nThe application is now at its experimental phase in its development and is currently being tested by a licensed Optometrist. The current implementations and documentations will provide the necessary knowledge for future developers to continue developing the application to be certified HIPAA compliant and be production ready."
        },
        {
            "time": "2:15 PM - 2:30 PM",
            "projectId": "csse-4-215",
            "title": "Educating Young Eye Research Group EmailService Project",
            "studentName": "Huantong Ji",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Bill Erdly",
            "posterLink": "./posters/csse/Huantong Ji.jpg",
            "abstract": "In recent research, nearly 40% of young children were missing out on vision screenings. Vision problems are a major cause of reading and writing difficulties for children, and students with vision problems spend most of their time decoding words. When they do not have the ability to use their eyes properly to read, more problems show up, such as an easy distraction or an inability to study for long periods of time. When we looked for reasons for not getting vision exams for children in a timely manner, we found that there were many reasons for the results, such as parents often forgetting clinic appointments, failing to change appointments in a timely manner for many reasons, and then neglecting the exams after missing them.\n\nAfter doing research, we wanted to deal with such a situation and raise awareness about vision issues. This is how the mail service was created. Through the mail service, patients can be reminded of their appointments, and through the emails, patients can make actions based on their schedule, and on the other hand, patients can be reminded of any other information about clinic.\n\nWe immediately made a survey and plan to choose simple email service from AWS, the cloud computing company currently used by the clinic. With the simple storage service and DynamoDB service, we implemented the feature of sending emails and saving attachments in the cloud.\n\nThis email microservice helps users remember important information and encourages them to organize upcoming events. In this rapid development of information technology, improving the user experience of customers can enhance customer loyalty and bring more customers to the clinic.\n\nAs a result, I have successfully implemented sending different types of emails, organizing and storing for emails with attachments, working with email templates, handling of HTTP response codes, etc. And the service documentation is ready to go, and the service is ready to use."
        },
        {
            "time": "2:30 PM - 2:45 PM",
            "projectId": "csse-4-230",
            "title": "EYE Research Group: UI/UX and Hardware",
            "studentName": "Qingran Shao",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Bill Erdly",
            "posterLink": "./posters/csse/Qingran Shao.png",
            "abstract": "Near Vision is dedicated to helping youth with eye health and eye safety. The team strives to provide affordable and extensive eye exams and referrals. Their services cover several major counties and school districts in Washington State. From this foundation, Near Vision joined forces with the University of Washington Bothell to form the Eye Research Group. The Eye Research group uses computer technology to explore, research, and achieve Near Vision's goals.\n\nAs a leader of the UI/UX team, I focus on generating a fine design in UI/UX sphere. UX refers to the user experience as the tool for a programmer to build communication between programs and users. Eye research Group wanted to create a platform where patients and doctors could communicate in a friendly way through the design of UX. The UI of the product will provide different levels of expertise to guide groups of people, such as doctors, nurses, and patients.  \n\nAs a UI/UX engineer, I set out to explore the needs of our clients for the web. At the same time, my team and I analyzed, researched, and evaluated existing web pages to generate documentation to support the subsequent design. During the project, we analyzed the Near Vision, Eye Research Group, Eye See Clinic, and Toolbox web pages and talked to Dr. Alan, our client. Through this process, my team and I identified design ideas and directions for each site, while I worked on redesigning the Toolbox website.\n\nDuring the SNOW conference, we met face-to-face with users to exchange product experiences and get insightful user feedback. After collecting the feedback, I, as the team leader, redefined a new development direction for the team. Thanks to our knowledge management, we were able to complete the web design more efficiently.\n\nBut my imagination of the subject doesn't stop at front-end development and team management. To provide users with information about Mobile Clinic, I also developed the Van Tracker webpage based on an embedded system as a way to provide users with a more user-friendly time planning service.\n\nIn this capstone, I found that top-level design and team management can greatly help the client, manager, and development team to communicate effectively. Also, a good design cannot leave the analysis of user feedback. My experience at Capstone made me realize that a T-shaped person will bring more benefits to the team."
        },
        {
            "time": "2:45 PM - 3:00 PM",
            "projectId": "csse-4-245",
            "title": "QuickCheck: Help Kids' Vision Problem",
            "studentName": "Wooyoung Sun",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Bill Erdly",
            "posterLink": "./posters/csse/Wooyoung Son.jpg",
            "abstract": "Distance Estimation from Face Image\n\nFormal members of EYE Research Group developed a mobile application, called QuickCheck, which helps Optometrists and School Nurses to screen the patients/students' Visual Acuity without using the Snellen chart. One of the problems was that the user must manually keep the distance from the phone to the patient as specified by the Washington State Board of Health. The project implements the machine learning algorithm, so it can estimate the distance just using the video captured by the front camera. However, this possesses a limitation: the typical machine learning project requires the researcher to collect the data, and in this case, it is the face of the patients and the distance. Keeping such information is strictly controlled by HIPPA/FERPA, so instead of collecting the data and training the new model, a pre-trained model from a similar domain is used: the face detection and landmark detection model. Implementation is done, yet evaluation of how accurate it is to be done in the future.\n\nSoftware Re-engineering\n\nAfter finishing the prototype of the Distance Estimation algorithm, the team structure changed as team members graduate and new members join, and I obtained the opportunity to lead the QuickCheck project. There were two things that had to be done: the first is to formalize the efficient project management and the second is to re-engineer the project to make it production-ready. Various diagrams learned from CSS360 and CSS370 are created to have a better understanding of the project at an abstract level for the team and myself, and we created a Trello board to adapt the Kanban-style agile development process. There, the tasks are broken down into smaller tasks and assigned to the team members. Also, the decision is made to use the Dependency Injection framework, called Zenject, which encourages the team to implement Inversion of Control, thus, in the end, the project is modular, testable, and resilient to new changes. The project release lifecycle has also been reformed by implementing the version control using git/GitHub with proper semantic versioning, which helps the end-users and the developers to effectively communicate various bugs or missing/new features. Alongside that, the use of the SOLID principle was encouraged to code more understandable and for better maintenance for future developers. Our team was able to deliver the final product in time."
        },
        {
            "time": "3:00 PM - 3:15 PM",
            "projectId": "csse-4-300",
            "title": "ExO: Excavators & Obelisks",
            "studentName": "Bryant Nguyen",
            "studentMajor": "CSSE",
            "projectType": "Individual Project",
            "facultyAdvisor": "Dr. Bill Erdly",
            "posterLink": "./posters/csse/Bryant Nguyen.png",
            "abstract": "Excavators and Obelisks (ExO) is a 3D play-to-earn collectable card video game web application where unique characters, cards, and items are completely user-owned, allowing for the trade, sale, and purchase between peer players and collectors. The project uses non-fungible tokens (NFTs) to enhance the experience of collectable trading card games, by allowing users to also be true owners to their virtual game assets. Players that own a NFT character will receive monetary rewards in the form of our project’s $SHRD fungible token for playing and interacting with the game. \n\nExO’s video game is largely built using Unity3D, C# scripts, JavaScript, and art developed by our team. The application uses the emerging Web3.0 infrastructure, where decentralized elements are being introduced to the web applications and browsers. The architecture revolves around a partly-decentralized model using the traditional client-server model, but with decentralized storage and ownership elements. AWS servers and MongoDB hosts our website and non-proprietary data, while smart contracts and tokens are deployed and minted on the decentralized Ethereum blockchain. Users can connect their address and access their game assets through a network node built into their MetaMask browser wallet to communicate with the blockchain and the smart contract functions.\n\nI managed a team of 8 people that were split into 3 sub-teams: software, visual design, and marketing divisions. In order to create a full-stack application, I delegated tasks and held agile weekly sprints with the project team. It was necessary to use agile practices because of the volatile and demanding market our application will be released to.\n\n The current state of the application and its results are beyond our expectations, but far from complete as it will need more development before it is commercially deployed. The primary contracts for minting the non-fungible token Excavator and obtaining $SHRD token rewards are finished and are in testing. The game is fully operable including features to buy and open packs of cards, an interface to create decks, and the ability to play a complete card game with a basic A.I. opponent.\n\n Throughout the project I gained experience in agile development, project management, and self-learning new emerging technologies. I also learned how to thoroughly test and debug web3.0 applications on both the client, server, and blockchain test networks. We will continue to build the project and hope to release it by the end of the year.   "           
        }                   
    ]
}