{
    "csse": [
        {
            "time": "12:45 PM - 1:00 PM",
            "projectId": "csse-3-1245",
            "title": "DeepTracer-ID System Development",
            "studentName": "Kiernan Connolly",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Dong Si",
            "posterLink": "./posters/csse/Kiernan Connolly.jpg",
            "abstract": "DeepTracerID is a system for identifying an unknown protein structure. DeepTracer is a tool for determining protein structure from Cryo-EM data. A protein structure might be generated through DeepTracer, but the specific protein and its amino acid sequence are not known. To solve this, AF2 protein structures (candidates) are generated from all possible amino acid sequences for that species and compared to the DeepTracer structure (target). In DeepTracerID, the candidate structures are first aligned to the target structure through PyMOL or FATCAT and then compared to the target structure and scored. The user can see which AF2 structure has the lowest score and determine which protein the unknown structure is most likely to be.\n\nDeepTracerID has three components: The website, the API, and the command line programs. The website allows users to access DeepTracerID and submit DeepTracerID analysis jobs. These jobs are then sent to the DeepTracerID API, which places the jobs into a queue. The DeepTracerID API retrieves jobs from the queue, executes them through the command line programs, and updates their status. Users can access the status of jobs and retrieve the results through the website.\n\nDeepTracerID is currently deployed on the DeepTracer website. The main functionality is available, but further work can be done to improve website functionality. Github workflows for automated testing were also created to assist in development. A Github webhook was also created for automatic deployment but requires debugging."
        },
        {
            "time": "1:00 PM - 1:15 PM",
            "projectId": "csse-3-100",
            "title": "DeepTracer-ID Methods",
            "studentName": "Luca Chang",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Dong Si",
            "posterLink": "./posters/csse/Luca Chang.png",
            "abstract": "DeepTracer is a fully-automated and robust machine learning system that determines the all-atom structure of a protein complex based solely on its cryo-electron microscopy map and an optional amino acid sequence. On its own, DeepTracer predicts protein complexes with high accuracy, but it does not always predict complexes that perfectly match the amino acid sequence of the target structure. DeepMind’s AlphaFold is a similar system that only uses amino acid sequences for its predictions. While the sequences of its predictions come directly from the input data, the accuracy of 3D structure of its predictions declines on large protein structures.\n\nIn this project, the groundwork for a postprocessing step for DeepTracer was developed, which searches databases of AlphaFold predictions to find corresponding AlphaFold instances of a DeepTracer prediction. This was implemented as a data analysis pipeline that leverages multiprocessing to perform structural alignments between the DeepTracer prediction and each stored AlphaFold prediction. Alignments are performed using PyMOL and FATCAT; two existing tools that fit this purpose. The resulting alignments are scored and sorted, with the top results being the most likely matches for the given DeepTracer prediction. Finally, the top alignments are clustered using Dali, to contextualize the results. This method was chosen due to the quality of the individual components used – many of the pieces are already mature applications, but they had yet to be combined for this particular purpose. Furthermore, the parallel nature of the method lends itself well to optimizations through distributed processing in the future.\n\nThe pipeline has been completed and deployed to a production environment, offered over an API for remote use. The DeepTracer website also provides access to the service for public research purposes. Currently, issues in the integration of Dali prevent the service from offering similarity matrices, but the core functionality works and can be optimized in the future. The system’s speed is insufficient for searching a complete database of AlphaFold predictions, but there is still significant room for utilizing higher degrees of parallelism for better results. In the future, this pipeline can be included in DeepTracer as part of a complete postprocessing step that integrates DeepTracer and AlphaFold predictions for improved sequence accuracy without compromising on structural accuracy."
        },
        {
            "time": "1:15 PM - 1:30 PM",
            "projectId": "csse-3-115",
            "title": "Psychosis iREACH",
            "studentName": "Skye Tran",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Dong Si",
            "posterLink": "./posters/csse/Skye Tran.png",
            "abstract": "Psychosis iREACH (Recovery by Enabling Adult Carers at Home) aims to build an AI-powered chatbot that uses evidence-based Cognitive Behavioral Therapy (CBT) to coach caretakers on patients with schizophrenia or other psychotic disorders. Currently, the project uses the foundation research layout by Dr. Turkington, Dr. Kopelovich, and Dr. Hardy from SpiritLab. Our service offers free training to equip relatives or friends of psychosis patients with evidence-based skills to better care for their loved ones.\n\nTo give access to caregivers across the United States, we have on-demand learning materials centralized on our application. Besides that, we also have a chatbot as a practice environment. Alfie is a fictional character with psychotic disorders. We hope the interaction with Alfie reinforces the learning materials and add value to their loved ones soon.\n\nIn this project, the groundwork and product design were developed. However, like other chatbot projects in the medical field, we require more data to build a robust AI-powered chatbot. As such, we need to build a data pipeline to collect user inputs. Before then, we built a rule-based chatbot using the Rasa framework to continue providing values and attracting more caregivers of psychosis patients. In return, we can collect more data for future uses.\n\nDue to time constraints and lower learning curves, we opted for a flexible tech stack using React/Redux for the frontend, Python/Flask for the backend, and storing user data on the DAIS server. With a popular tech stack, it enables contributions from new members, allowing us to push the product by Summer 2022.\n\nWhen the project just started, I helped the design team to develop prototypes for monthly user research. I looked at external tools such as Figma and LandBot for rapid prototyping. When we decided on the features of an MVP, I developed the backend of the data pipeline, allowing us to securely store users’ inputs and other metrics such as their usage, personas, and behaviors. Moreover, I designed a scalable and flexible structure to allow members of the research team to add new learning modules, mock conversations, or new practice scenarios easily.\n\nIn the future, we hope to gather a lot of users’ inputs in the next few months, so the chatbot can be more realistic and interactive. There is a lot more to be done, but we hope this path will lead to an independent virtual coach for caretakers one day."
        },
        {
            "time": "1:30 PM - 1:45 PM",
            "projectId": "csse-3-130",
            "title": "Macromolecular Segmentation, Testing and Research from Cryo-EM Images",
            "studentName": "Victor Suciu",
            "studentMajor": "CSSE",
            "projectType": "Project Type",
            "facultyAdvisor": "Dr. Dong Si",
            "posterLink": "./posters/csse/Victor Suciu.png",
            "abstract": "3D Cryo Electron Microscopy (Cryo-EM) is a method of taking 3D photographs of molecules at atomic-level resolution. Researchers can isolate a molecule like DNA or protein, scan it with an electron microscope from multiple angles, and combine the resulting scans to recreate a 3D image of the molecule itself. This method is better than any molecular imaging method that came before it, but images produced by Cryo-EM are still noisy and often difficult to understand. Hence, it is a labor-intensive process to determine the actual atomic structure captured by a Cryo-EM photo. Retrieving the atomic structure is useful in biological and medical research including vaccine creation and bacterial study.\n\nI first worked on identifying different types of molecules that might appear in a Cryo-EM image. Specifically, I worked on automatically detecting the boundaries between DNA, RNA, and protein molecules in the same image. I did this by employing standard image segmentation methods based on deep learning to Cryo-EM images. This is because these techniques have been shown to work well on Cryo-EM segmentation in the past. The resulting neural network could segment a Cryo-EM image into DNA/RNA and protein regions to a usable degree. All work was done in Python and Tensorflow.\n\nAfterwards, I worked on automated testing scripts for a DNA/RNA modeling pipeline. The existing pipeline could only process one image at a time, so I created a testing script to automatically run the pipeline on a directory of images. This helped in doing large-scale testing on hundreds of images. All work was done in Python and bash.\n\nI helped collaborators in our group with their bacterial research, studying the composition of nanowires on the surface of bacteria cells. I created a Python script that iterated over large datasets of proteins and computed the pairwise distance and rotation matrix between their heme molecules. The data helped prove the composition and conductivity of these nanowires and the work has been accepted to Nature Microbiology."
        },
        {
            "time": "1:45 PM - 2:00 PM",
            "projectId": "csse-3-145",
            "title": "One More Thing",
            "studentName": "Michael Kilgore",
            "studentMajor": "CSSE",
            "projectType": "Individual Project",
            "facultyAdvisor": "Dr. Robert Dimpsey",
            "posterLink": "./posters/csse/Michael Kilgore.png",
            "abstract": "For my capstone I chose to create a shopping list application that introduces market beating features in quality and uniqueness, and that application is called One More Thing. The purpose of this project was to create something that was overall better than the other options available on the IOS app store.\n\n Shopping List applications aim to help the user with convenience related to shopping. However they miss the mark in some areas. One More Thing has a better search DB than other applications, and introduces new features that increase the level of convenience. Some of these new features include batch adds, and recurring adds. Batch adds allow users to store groups of items that can be added to lists, and recurring adds allow users to set up items to be re-added to shopping lists.\n\nIn the end my application successfully approaches problems in a way that is better in many ways, as well as takes new approaches to problems that have never been seen before. The significance of this project is that within the last 5 months I’ve managed to identify weak points in existing apps on the app store, and then make them strong points in One More Thing."
        },
        {
            "time": "2:00 PM - 2:15 PM",
            "projectId": "csse-3-200",
            "title": "The Vulnerability Management Project at Mayo Clinic",
            "studentName": "Eric Pham",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship",
            "facultyAdvisor": "Dr. Geetha Thamilarasu",
            "posterLink": "./posters/csse/Eric Pham.png",
            "abstract": "In the past three months of my internship at Mayo Clinic on the Security Testing Services (STS) team, I was given the opportunity to experience a wide variety of cybersecurity concepts I could apply or recommend to other organizations in my future career in cybersecurity. Some of the basic cybersecurity concepts I learned at Mayo Clinic are the following:\n\nOperationalize dynamic application security scans\n\n Become familiar with remediation recommendations to strengthen and sanitize code that may suffer from exploitable vulnerabilities\n\n Learn about the tools and techniques use to perform manual testing used in validation of remediation\n\n Identify areas of automating tasks to produce Excel-based metrics through functions as opposed to vulnerable VBA code\n\nSoftware engineers at Mayo Clinic are working to help medical researchers improve health care treatments and outcomes via machine learning and artificial intelligence. Because Mayo Clinic makes some of their applications, models, and medical data available to third parties, the confidentiality, integrity, and availability of these assets need to be protected. The work performed by the STS team demonstrates the commitment Mayo Clinic makes toward protecting its patients, employees, and reputation.\n\nThe outcome of this project is to design and implement procedures that will help the methods and operations employed by STS to increase the security of Mayo Clinic applications. I automated and utilized Excel functionality to calculate remediation dates based on a number of variables from a raw data set.  This effort saved STS analysts and engineers time that allowed them to focus on tasks that cannot be automated. I also used Application Security tools to approve remediations through manual dynamic testing and automate dynamic testing using the Selenium IDE. While I participated in many small day or week-long projects, it is my hope that my work expanded the capabilities of STS in a way that will provide an impact long past the last day of my internship. "
        },
        {
            "time": "2:15 PM - 2:30 PM",
            "projectId": "csse-3-215",
            "title": "Deep Learning and Augmentation for Inferring EEG Signals",
            "studentName": "Zach Liong",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Geetha Thamilarasu",
            "posterLink": "./posters/csse/Zachary Liong.png",
            "abstract": "Electrocochleogram, or EEG, is a medical recording tool to help doctors analyze their patient’s electrical brain activities. The main functionality of these EEG devices is to diagnose patients for any abnormal medical conditions like epilepsy, brain tumors, and dementia. In recent years, EEG devices have shifted towards commercial uses, allowing easier accessibility for the public and giving them non-medical purposes like therapeutical and psychological analysis. Furthermore, there are researches that EEG signals can be converted into inputs like hand gestures, numerical digits, and words. Since these commercial EEG recording devices are constantly recording and monitoring the user’s brainwaves, malicious hackers can always monitor and access the user’s private information to create an inferred detailed user profile without the consent of the user.\n\nTherefore, the goal of this project is to demonstrate that it is possible to create a program that take recorded EEG signals and be able to perform classification to extract sensitive information using commercial EEG headsets like MUSE2. \n\nThis project uses deep learning models like convolutional neural networks (CNN) and recurrent neural networks (RNN). Deep learning models can help in analyzing and classifying large amounts of noisy EEG signals. Since EEG signals are prone to noises in its recording environment, there are several signal preprocessing methods like bandpass or infinite impulse response filters to reduce the noise within the EEG signal to extract relevant and crucial information while exploring which preprocessing filter techniques can best refine the signal. In addition, there is the use of data augmentation to generate synthetic signals for the training of the deep learning models and signal transformation into 2-D images using Fourier transformation for CNN input. "
        },
        {
            "time": "2:30 PM - 2:45 PM",
            "projectId": "csse-3-230",
            "title": "Investigating Security Attacks on the Internet of Medical Devices",
            "studentName": "Roy Kwok",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Geetha Thamilarasu",
            "posterLink": "./posters/csse/Roy Kwok.jpg",
            "abstract": "IoT devices are getting popular in different fields, like medical, home, etc.  But IoT devices have some security issues, no specific software to protect the IoT devices, which will be very dangerous.   For example, in 2020, a hospital used the ultrasound IoT device to help a pregnant woman born her baby, but the ultrasound device got hacked by an attacker then the woman got in danger and almost died.  \n\nConsidering that, I summarized the two popular networking attacks and then created software to defend against the attacks.  The first one is to defend against DDoS attacks.  When the program detects many requests in 5 seconds getting into the device, the device will notify the user and tell the user the device is getting a DDoS attack to ask if the user wants to shut down the device.  The second program is to defend against SQL injection to avoid the attackers typing in some illegal information entered by the user, which plays a protective role protect the client's privacy and company secrets.  \n\nThis project aims to understand the threat of IoT devices and protect the IoT devices to protect the IoT devices users and users' privacy.  I wrote two programs to give the IoT devices the basic and essential protection, and maybe it will be helpful to other researchers in the future on how the IoT devices can be safer.   Or maybe in the future, someone will create specific standard security software that can be put on all IoT devices to secure IoT devices, clients' privacy, and important information."
        },
        {
            "time": "2:45 PM - 3:00 PM",
            "projectId": "csse-3-245",
            "title": "Findr: Money-Saving Application",
            "studentName": "Huy Nguyen",
            "studentMajor": "CSSE",
            "projectType": "Group Project",
            "facultyAdvisor": "Dr. Geetha Thamilarasu",
            "posterLink": "./posters/csse/Huy Nguyen.png",
            "abstract": "During college time at the University of Washington, we have learned many computational concepts. For this capstone, our team focuses on coding in multiple languages and following fundamental to advanced software principles, to develop micro-services, serverless, APIs, and cloud-based applications using Azure and Amazon Web Services (AWS). We have developed and deployed Findr, a web application to deliver an exhilarating grocery shopping experience to the users. The team members include Professor Geethapriya Thamilarasu as an advisor, Professor Munehiro Fukuda as a sponsor, and Thong Ton and Huy Nguyen as core team development. \n\nAfter this project, we have gained a deeper understanding and experience in software development:\n\n● We developed our own algorithm, APIs, and data workflow\n\n● We utilized existed libraries/APIs for the faster coding process\n\n● We utilized Cloud services for faster the deployment time and better manage resources\n\n● We embrace DevOps practice to keep track of development progress, testing, and operations\n\nGiven the current economic situation, with inflation and rising prices, we wanted to develop a web application that can help enhance the grocery shopping experience by helping users find the cheapest grocery items without hassle. Users can use the application to find discounts and cheap items from their local supermarkets, then all they have left to do is go to the store and grab those items!\n\nWhen the application was introduced to friends, family members, and other users, they were impressed. The users were able to find cheaper grocery items or items that are on discount from nearby supermarkets without having to do extensive research. After a few weeks of deployment, we were able to attract about 20+ real users to try out and use the application. The feedback we received were both positive and constructive. \n\nThis cloud-based, web application will help college students, low-income family, or anyone who might want to save money and time on grocery shopping can benefit from using this application to do grocery. This application is already deployed and at its early stages. We hope to attract users, improve, and optimize the application by scaling and expanding features to the web app."
        },
        {
            "time": "3:00 PM - 3:15 PM",
            "projectId": "csse-3-300",
            "title": "Findr: Money-Saving Application",
            "studentName": "Thong Ton",
            "studentMajor": "CSSE",
            "projectType": "Group Project",
            "facultyAdvisor": "Dr. Geetha Thamilarasu",
            "posterLink": "./posters/csse/Thong Ton.jpg",
            "abstract": "During college time at the University of Washington, we have learned many computational concepts. For this capstone, our team focuses on coding in multiple languages and following fundamental to advanced software principles, to develop micro-services, serverless, APIs, and cloud-based applications using Azure and Amazon Web Services (AWS). We have developed and deployed Findr, a web application to deliver an exhilarating grocery shopping experience to the users. The team members include Professor Geethapriya Thamilarasu as an advisor, Professor Munehiro Fukuda as a sponsor, and Thong Ton and Huy Nguyen as core team development. \n\nAfter this project, we have gained a deeper understanding and experience in software development:\n\n● We developed our own algorithm, APIs, and data workflow\n\n● We utilized existed libraries/APIs for the faster coding process\n\n● We utilized Cloud services for faster the deployment time and better manage resources\n\n● We embrace DevOps practice to keep track of development progress, testing, and operations\n\nGiven the current economic situation, with inflation and rising prices, we wanted to develop a web application that can help enhance the grocery shopping experience by helping users find the cheapest grocery items without hassle. Users can use the application to find discounts and cheap items from their local supermarkets, then all they have left to do is go to the store and grab those items!\n\nWhen the application was introduced to friends, family members, and other users, they were impressed. The users were able to find cheaper grocery items or items that are on discount from nearby supermarkets without having to do extensive research. After a few weeks of deployment, we were able to attract about 20+ real users to try out and use the application. The feedback we received were both positive and constructive. \n\nThis cloud-based, web application will help college students, low-income family, or anyone who might want to save money and time on grocery shopping can benefit from using this application to do grocery. This application is already deployed and at its early stages. We hope to attract users, improve, and optimize the application by scaling and expanding features to the web app."
        }                  
    ]
}