{
    "csse": [
        {
            "time": "12:45 PM - 1:00 PM",
            "projectId": "csse-5-1245",
            "title": "Archeology Website Prototype",
            "studentName": "William Weideman",
            "studentMajor": "CSSE",
            "projectType": "Internship",
            "facultyAdvisor": "Dr. Arnie Lund",
            "posterLink": "./posters/csse/William Weideman.png",
            "abstract": "In the world of archeology, project managers are on a constant look for both volunteers for their programs as well as more funding. They constantly need to scout for high-functioning, work driven sponsors to ensure that their vision can come to life. Gehrig Pfeffer sponsored me, William Weideman, to create a prototype for a website that would connect archeology project managers with potential volunteers and sponsors in a networking website. I was tasked with creating this website to present it to a non-profit company.\n\nI had to not only create the prototype of this website but also complete all of the user experience research. This includes but is not limited to, user personas, user scenarios, user journey maps, user interviews, usability testing, and other organizational methods like card sorting. I used all of these methods to implement a website that works for the vast majority of participants. One of my main goals is to take into account the needs, wants and concerns of the three different personas that I collaborated with on this project. This project came with many challenges as I was trying to explore an alternative set of skills within computer science. I had to overcome my own personal failings as a designer by relying heavily on other people to point out mistakes in my design.another challenge I had to face was to adapt quickly to ever changing schedules of the participants and working with what I had at any given time.\n\nBy focusing on the user experience research, I learned many skills within the user experience field which helped aid my growth as a computer scientist. I had to overcome many challenges when researching and exploring my archeology project. One of which is my lack of artistic skills and having to overcome that to create the website. This gave me numerous challenges that I had to overcome as I couldn't rely on my coding experience to create a website that looks and feels satisfying. I had to also overcome numerous time issues with having to reschedule people and working around the numerous schedules of the people I interviewed.\n\nI still have some small things to finish on the project in preparation for the meeting with the non-profit company coming very soon. This project has helped me learn so much about all the steps and things needed in creating a prototype. One of the major lessons I learned are the things I am not good at and how to work around my failings to still create a good product."
        },
        {
            "time": "1:00 PM - 1:15 PM",
            "projectId": "csse-5-100",
            "title": "Full-Stack Development Internship at Gennev",
            "studentName": "Connor Peace",
            "studentMajor": "CSSE",
            "projectType": "Internship",
            "facultyAdvisor": "Dr. Afra Mashhadi",
            "posterLink": "./posters/csse/Connor Peace.png",
            "abstract": "As a Full-Stack Software Engineer at Gennev, I led the project to migrate the static pages of our front-end site from a self-built application to a website builder to reduce the time between requested changes and deployments with a thinner engineering team.\n\nAt the start of my capstone we had just made a decision to reduce the size of our engineering team to focus our revenue towards marketing efforts. Even though the size of the engineering team was reducing, the marketing team needed our website to be flexible enough that same-day changes could be made at will.\n\nThus, we decided to move the less-interactive pages of our site which get the most organic traffic to a website builder rather than our self-built application.\n\nThe project required me to fully understand our current Google Cloud Platform (GCP) configuration which included load balancers, DNS setup, and much more.\n\nWith only a few hiccups along the way, the migration was successful and our static pages now live on a website builder's servers while the dynamic side of our website lives on our own GCP instances. \n\nNow, the marketing team has flexibility to make changes that deploy within minutes across most of our site without needing engineering time to do so."
        },
        {
            "time": "1:15 PM - 1:30 PM",
            "projectId": "csse-5-115",
            "title": "Nostalgic Analysis of Location-Based Tweets",
            "studentName": "Larissa Gao",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Afra Mashhadi",
            "posterLink": "./posters/csse/Larissa Gao.jpg",
            "abstract": "Social media posts have been increasingly used as mediums for gaining insight into a wide spectrum of human experiences. We are particularly interested in understanding the attributes of online conversations in relation to collective memories and nostalgic recollections. In this work, we examined features of social media posts that characterized users’ collective memories of different visited Points-of-Interest (POI). \n\nWe focused on analyzing the following attributes extracted from geotagged Twitter posts: location geotags, location entities, time entities, and object entities. To better understand which objects and temporal/spatial references that people tend to mention in nostalgic conversations, we found the frequency of entity mentions from a dataset of over 500,000 nostalgic tweets. We also calculated the rates of positive, neutral, and negative sentiment for tweets in each category. \n\nOur results revealed that users frequently tweeted about nostalgic memories from schools, restaurants, and churches. People tended to reference the past in terms of years and mostly mention general geographic regions and outdoor locations. Sentiment analysis for geotagged locations and location entities showed that users mostly felt positive or neutral, while users felt more positive about future years than the past and present.\n\nThis work establishes the use of nostalgic tweets as mediums for analyzing collective memories in relation to visited POIs. We provided a methodology to quantify nostalgic experiences for different features of Twitter posts. Our findings provide insight into the relationship between collective memories and language about time and place."
        },
        {
            "time": "1:30 PM - 1:45 PM",
            "projectId": "csse-5-130",
            "title": "Tweets Analysis - Park Visiting Before and After Pandemic",
            "studentName": "Man-Ling Chen",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Afra Mashhadi",
            "posterLink": "./posters/csse/Mandy Chen.jpg",
            "abstract": "In this faculty research project, the goal is to perform sentiment analysis on Twitter posts by classifying whether or not they are of type “reminiscent”, specifically for Tweets pertaining to public parks before and after the COVID-19 pandemic. We want to understand how people’s thoughts and behavior changed after the outbreak of the COVID-19.\n\n The methodology consists of collecting a dataset of Tweets and then applied with a natural language processing machine learning model.  Due to the advancement of technology, more and more people nowadays rely on social media as a communication platform or as their daily life recording tool. Thus, we collected tweets dataset from five major metropolitan cities— Los Angeles, Phoenix, Houston, Chicago, and New York City. For each city, we selected ten parks for our target sample data collection. By analyzing the dataset, we want to understand how the COVID-19 pandemic and stay-at-home order influence people visiting parks. We used Twitter API version 2 and Twarc2, a command line tool and python library that collects tweets, for our data crawling. In addition, we utilized open-source API such as “Hugging Face” for sentiment analysis and “Heideltime” for time entity analysis contained in the tweets.\n\nThe result of the analysis clearly shows that people reduce their outdoor activities right after the outbreak of the COVID-19 and the stay-at-home order. Fortunately, the sentiment analysis shows that people’s attitude toward park visiting is still positive. In addition, after the stay-at-home order had been lifted, we notice that most of the cities in scope experienced a spike of traffic and soon continue with the overall downward trend. Moreover, the proportion of the unique users out of the total traffic post locked down is clearly less than the proportion before the pandemic. We observed that the park visitors post locked down are mainly local residents. This analysis will help better understand the general public’s sentiment towards public parks before and after the pandemic, which will inform the improvement of policies of the parks.\n\nIn summary, based on the analysis, the COVID-19 pandemic didn’t affect much about people’s usage of park especially for local community and neighborhood.  The traffic lost is mostly due to less visitors to the cities."
        },
        {
            "time": "1:45 PM - 2:00 PM",
            "projectId": "csse-5-145",
            "title": "Data Collection and Analysis Application for Research - A Crowdsensing Platform for Ubiquitous Taste Recognition",
            "studentName": "Melkieneh Worku",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Afra Mashhadi",
            "posterLink": "./posters/csse/Melkieneh Worku.png",
            "abstract": "Web applications that are deliberately designed for research study can facilitate the work for researchers. We designed an application that collects data from research participants. This app developed to collect basic participant information and coffee sample taste data. This is developed parallel to the development of a machine that collects an independent coffee data for further analysis and labeling of a coffee taste. We classified the tastes in three different labels. The first label includes four basic taste types that are sweet, bitter, salty, and sour. The second and the third label have only two alternative choices. We have design a single question per page to avoid the confusion. The simplicity of the design makes it easy and clear for participants to choose between and we added a skipping choice in case they can’t classified further. The database system also developed to store important information. The database is accessible for administrator users only. This application is designed to collect, and analysis data based on human entered information and electronic data. The aim of this project is to get consistent and cluster able participant inputs and electronic taste data. "
        },
        {
            "time": "2:00 PM - 2:15 PM",
            "projectId": "csse-5-200",
            "title": "The Analysis of the Change of Visitors in Seattle Parks During the Pandemic",
            "studentName": "Ting-Shiuan Chen",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Afra Mashhadi",
            "posterLink": "./posters/csse/Ting-shiuan Chen.jpg",
            "abstract": "The purpose of the project is to understand the change of the visitors in Seattle Parks during the Pandemic, which started from January 2018 to December 2021, through social media and the Seattle area census tract data. The World Health Organization (WHO) declared the COVID-19 pandemic on March 11, 2020, people changed their way of communication, work, lifestyle, and more. After CDC announced travel restrictions, people were not able to travel as usual. For this project, I analyzed the tweets data and the census data in Seattle Area.\n\nIn the study, the plot for the number of tweets on each month and year showed that the number of tweets is continuously decreasing; there especially was a huge drop in March 2020. The sentiment analysis on the tweets became unstable after March 2020.  The time series analysis showed that visitors from other census block areas are less likely to visit Seattle Parks that are located outside their areas during the post-pandemic. I assumed that because of the outbreak of coronavirus and travel restrictions, fewer visitors went to the Seattle Parks. Based on the above results, I defined March 2020 as the time of the pre-pandemic and post-pandemic in my analysis.\n\nThe time series features analysis showed most of the data have high seasonality strength and entropy. Seasonality is seasonal variations that occur at certain regular intervals. A value of seasonality strength close to 1 means having seasonality, and it means that those time series data have a regular pattern. It is reasonable when analyzing the data related to Parks. Entropy is the measure of the disorder of a time series. A time series with higher entropy will be hard to forecast. The statistic showed entropy increasing over pre-pandemic and post-pandemic. Most of the Seattle Parks regarding their in-degree where people travel from are unpredictable and hard to forecast.\n\n  The result indicated that fewer people visited the Seattle parks during the post-pandemic due to the coronavirus outbreak and travel restrictions. It also indicated that most of the time series data for pre-pandemic and post-pandemic have regular pattern, but they are not suitable for forecasting due to the high value of entropy.  "
        },
        {
            "time": "2:15 PM - 2:30 PM",
            "projectId": "csse-5-215",
            "title": "Stroke Rehabilitation Tools in an Edge Computing Environment",
            "studentName": "Duy Vu",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Erika Parsons",
            "posterLink": "./posters/csse/Duy Vu.jpg",
            "abstract": "Stroke is a common medical condition that approximately about 795,000 people across the United States experience once or more times each year. It is one of the leading causes of long-term disability, and its effect is worse on older people. For this reason, the engineer and neuroscience research team have come together to collaborate and develop a technology to assist with the rehabilitation of stroke patients. While stroke comes in many different conditions and symptoms, we will be focusing on the condition known as spatial neglect. We will have the patient go through a process that involves devices like a robot, EEG, eye tracker, and interactive base station. The patient will be interacting with these devices to help the team collect data to aid the machine learning process and the patient’s condition.\n\nAs part of the computer science team, we will be focusing on the edge computing aspect of this project. Our goal is to use edge computing technology to establish communication between local devices and the cloud using AWS services and an open-source container orchestration called Kubernetes. Using Kubernetes, we can scale horizontally and vertically, which we can control and access from anywhere using the control plane in the cloud. With our current progress, we connected the local microprocessor as an edge node to the control plane up in the cloud using KubeEdge. Once we are up in the cloud, it will open up new opportunities to use other services available in the AWS cloud, such as the EBS, S3, and more. The cloud will provide us with scalability, security, flexibility, and mobility."
        },
        {
            "time": "2:30 PM - 2:45 PM",
            "projectId": "csse-5-230",
            "title": "Stroke Rehabilitation: Tools in an Edge Computing Environment",
            "studentName": "Madison Dienhart",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Erika Parsons",
            "posterLink": "./posters/csse/Madison Dienhart.png",
            "abstract": "The Rehab Robot research project uses a line following robot named “Gizmo” in a physical therapy setting for the rehabilitation of patients who have suffered from a stroke. This quarter the project aimed to take the interaction already established between the patient and Gizmo and build upon it even further to account for a symptom known as visual field neglect. In simple terms this symptom means patients lose awareness of Gizmo’s existence in the moments that he has left their field of vision. To combat this, an EEG, camera station, laptop, and base station are necessary to track both brain waves and eye movement to detect the occurrence of the symptom during physical therapy.\n\n My role on this project was to help solve the problem of the multiple new components considering their computational and data needs. A proposed solution is through edge computing, as it is the process of keeping computation and data closer to the source. Each component (not all but most) has a microprocessor that collects data and performs computations. I was to implement and design a system that allows for efficient computation and data processing necessary for real-time robotic interactions, as well as long term data storage, and more complex computations.\n\nThe solution was found through several tools such as Kubernetes, kubeedge, and AWS cloud computing services. The reason I chose this method is because Kubernetes along with an open-source system called kubeedge allow for the ability of the user to orchestrate computing, networking, and storage with flexibility. This combined with the synchronization of AWS adds the benefit of scalability through the cloud. Kubeedge works through the use of nodes, these can be onsite or remote, physical, or virtual. Nodes work similarly to a server, however there are many of them connected through a cluster. Nodes can contain multiple pods which perform operations, if one pod fails another one can be automatically generated. In this system nodes were implemented on the base station, laptop, and in the cloud. Another component implemented was a volume, which creates the possibility for storage in the cloud. \n\nThe interaction between devices and the cloud now present means even more specific development and data analysis are possible in the future. For example complex machine learning can take place in the cloud, while small computations take place locally so robotic interactions can occur in real-time allowing for improved treatment of the patient."
        },
        {
            "time": "2:45 PM - 3:00 PM",
            "projectId": "csse-5-245",
            "title": "Stroke Rehabilitation Tools in an Edge Computing Environment",
            "studentName": "Vincent Le",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Erika Parsons",
            "posterLink": "./posters/csse/Vincent Le.png",
            "abstract": "The stroke rehabilitation project focuses on rehabilitation exercises for patients suffering from strokes. The patients interact with a small robot called the gizmo 2.0 while wearing an EEG helmet which monitors their brain activity while doing exercises with the gizmo 2.0. This project is in collaboration with the engineering team as well as Harborview medical center’s rehabilitation medicine. Our goal is to use machine learning and edge computing to develop a platform to assist with this project. The project uses various types of processors primarily Jetson devices to build the infrastructure. We helped design, develop, and deployed a system which allows for communication between the different devices and to the cloud. We primarily used Kubernetes and KubeEdge to bridge the devices together. Kubernetes allows for the devices to communicate together using a local connection. KubeEdge allows for devices to communicate together and also to the cloud which acts as a control point where we may be able to store data which can be accessed later. Data science and machine learning will be used to analyze and preprocess the  data collected from brain sensors and eye tracking, to determine whether there are correlations found to predict brain behaviors.\n\n Our team was successful in setting up and integrating Kubernetes and KubeEdge on our local devices and tested connections between different devices to see if they could communicate together and to the cloud. We were able to connect the base station to the cloud successfully using KubeEdge. This was a big step in our project since we ran into many problems with the setup of KubeEdge. KubeEdge is an experimental software that expands upon Kubernetes allowing cloud access for worker nodes on devices, so they are not constrained by a local connection. Since we were the first students to use this software, we ran into many time-consuming issues with the setup and connection to the cloud. Since we have successfully setup the KubeEdge and Kubernetes software, the team going forward with this project will not have to spend so much time setting up this software and can focus on things like storage container and machine learning algorithms to preprocess the data. "
        }                  
    ]
}